ERP.belugaerp/src/DataProcessors/бг_ВыгрузкаМарокУпаковок/бг_ВыгрузкаМарокУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_ВыгрузкаМарокУпаковок</name>
  <tabularSections>
    <name>СтатусыМарок</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусМарки</name>
      <type>
        <types>EnumRef.бг_СтатусыАкцизныхМарок</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарокОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстатокСклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарокОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарокКВыгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстатокСклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарокОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарокКВыгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP.belugaerp/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДвижениеМарок/бг_ДвижениеМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДвижениеМарок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>КодУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусМарки</name>
    <type>
      <types>EnumRef.бг_СтатусыАкцизныхМарок</types>
    </type>
  </resources>
  <dimensions>
    <name>ГУИДМарки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ИдентификаторыМарок/бг_ИдентификаторыМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ИдентификаторыМарок</name>
  <resources>
    <name>НомерМарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторМарки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияФСМ</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </resources>
  <dimensions>
    <name>ГУИДМарки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СтатусыАкцизныхМарок/бг_СтатусыАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыАкцизныхМарок</name>
  <enumValues>
    <name>ВключенаВАктПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВАктСписания</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВДокументВозврата</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтчетОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВЭтапПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>Выбыла</name>
  </enumValues>
  <enumValues>
    <name>КОприходованию</name>
  </enumValues>
  <enumValues>
    <name>НаБалансе</name>
  </enumValues>
  <enumValues>
    <name>Оклеена</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленаКУничтожению</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Уничтожена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузкуОбработаноЕГАИС</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ТТНВходящаяЕГАИС/ТТНВходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНВходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДоверительнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перенаправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварВПутиПринадлежитГрузополучателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упакована</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_ФактическаяКрепость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Поставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>17</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Шаг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузоотправительКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузополучательКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/DataProcessors/бг_ВыгрузкаМарокУпаковок/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьВыгружаемыеСтатусыМарок();
	ЗаполнитьВидыНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьВыгружаемыеДанные(Команда)
	
	Если Не ВозможноЗаполнениеСтатусовМарок() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВыгружаемыеДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМарки(Команда)
	
	Если Не ВозможнаВыгрузкаМарок() Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеПослеВопроса = Новый ОписаниеОповещения("ВыгрузитьМаркиЗавершение", ЭтотОбъект);
	
	ПомеченныеСтрокиСерии = ПомеченныеСтроки(Объект.Серии);
	
	КоличествоМарокКВыгрузке = 0;
	Для каждого ПомеченнаяСтрокаСерии Из ПомеченныеСтрокиСерии Цикл
		КоличествоМарокКВыгрузке = КоличествоМарокКВыгрузке + ПомеченнаяСтрокаСерии.КоличествоМарокКВыгрузке;
	КонецЦикла;
	
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Будут выгружены актуальные состояния %1 марок по %2 сериям вместе с текущей структурой упаковок. Продолжить?'"),
		КоличествоМарокКВыгрузке,
		ПомеченныеСтрокиСерии.Количество());
	
	ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМаркиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьМаркиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтметитьВсе(Команда)
	ИзменитьОтметки(Объект.Номенклатура, Истина);
	ИзменитьОтметки(Объект.Серии, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСнятьОтметкуСоВсех(Команда)
	ИзменитьОтметки(Объект.Номенклатура, Ложь);
	ИзменитьОтметки(Объект.Серии, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СерииОтметитьВсе(Команда)
	
	ТекущаяСтрокаНоменклатура = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущаяСтрокаНоменклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаНоменклатура.Пометка = Истина;
	ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке = ТекущаяСтрокаНоменклатура.КоличествоМарокОстаток;
	
	ИзменитьОтметки(Объект.Серии, Истина, ТекущаяСтрокаНоменклатура.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура СерииСнятьОтметкуСоВсех(Команда)
	
	ТекущаяСтрокаНоменклатура = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущаяСтрокаНоменклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаНоменклатура.Пометка = Ложь;
	ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке = 0;
	
	ИзменитьОтметки(Объект.Серии, Ложь, ТекущаяСтрокаНоменклатура.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСерииПоЧастиНаименования(Команда)
	
	ОповещениеПослеВводаСтроки = Новый ОписаниеОповещения("ОтметитьСерииПоЧастиНаименованияЗавершение", ЭтотОбъект);
	
	ПоказатьВводСтроки(
		ОповещениеПослеВводаСтроки,
		НаименованиеСерии,
		НСтр("ru='Будут отмечены серии, содержащие введенный текст'"));
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОтметитьСерииПоЧастиНаименованияЗавершение(ВыбраннаяСтрока, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяСтрока = Неопределено Или ПустаяСтрока(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьОтметки(Объект.Номенклатура, Ложь);
	ИзменитьОтметки(Объект.Серии, Ложь);
	
	ВыбраннаяСтрока = СокрЛП(ВыбраннаяСтрока);
	
	ОтметитьСерииПоЧастиНаименованияЗавершениеНаСервере(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьВыгружаемыеДанные(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОчиститьВыгружаемыеДанные(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСОстаткомНаСкладеПриИзменении(Элемент)
	ОчиститьВыгружаемыеДанные(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтатусыМарокПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СтатусыМарок.ТекущиеДанные;
	
	ОчиститьВыгружаемыеДанные(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВидыНоменклатуры.ТекущиеДанные;
	
	Если ТекущаяСтрока.Пометка Тогда
		
		Для каждого СтрокаВидыНоменклатуры Из Объект.ВидыНоменклатуры Цикл
		
			Если СтрокаВидыНоменклатуры <> ТекущаяСтрока И СтрокаВидыНоменклатуры.Пометка Тогда
				СтрокаВидыНоменклатуры.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ОчиститьВыгружаемыеДанные(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриАктивизацииСтроки(Элемент)
	
	Элементы.Серии.ОтборСтрок = Неопределено;
	
	ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Серии.ОтборСтрок = Новый ФиксированнаяСтруктура(
		Новый Структура(
			"Номенклатура",
			ТекущаяСтрока.Номенклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Пометка Тогда
		ТекущаяСтрока.КоличествоМарокКВыгрузке = ТекущаяСтрока.КоличествоМарокОстаток;
	Иначе
		ТекущаяСтрока.КоличествоМарокКВыгрузке = 0;
	КонецЕсли;
	
	СвязанныеСерии = Объект.Серии.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
	
	Для каждого СтрокаСвязанныеСерии Из СвязанныеСерии Цикл
		
		СтрокаСвязанныеСерии.Пометка = ТекущаяСтрока.Пометка;
		
		Если СтрокаСвязанныеСерии.Пометка Тогда
			СтрокаСвязанныеСерии.КоличествоМарокКВыгрузке = СтрокаСвязанныеСерии.КоличествоМарокОстаток;
		Иначе
			СтрокаСвязанныеСерии.КоличествоМарокКВыгрузке = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СерииПометкаПриИзменении(Элемент)
	
	ТекущаяСтрокаСерии = Элементы.Серии.ТекущиеДанные;
	Если ТекущаяСтрокаСерии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаНоменклатура = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущаяСтрокаНоменклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрокаСерии.Пометка Тогда
		
		ТекущаяСтрокаСерии.КоличествоМарокКВыгрузке = ТекущаяСтрокаСерии.КоличествоМарокОстаток;
		ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке = ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке
			+ ТекущаяСтрокаСерии.КоличествоМарокОстаток;
			
		Иначе
			
		ТекущаяСтрокаСерии.КоличествоМарокКВыгрузке = 0;
		ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке = ТекущаяСтрокаНоменклатура.КоличествоМарокКВыгрузке
			- ТекущаяСтрокаСерии.КоличествоМарокОстаток;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьСерииПриИзменении(Элемент)
	
	Если Не ВыгружатьСерии Тогда
		СоздаватьСлужебныйДокументСодержащийСерии = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСлужебныйДокументСодержащийСерииПриИзменении(Элемент)
	
	Если СоздаватьСлужебныйДокументСодержащийСерии Тогда
		ВыгружатьСерии = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПомеченныеСтроки(Таблица)

	Возврат Таблица.НайтиСтроки(Новый Структура("Пометка", Истина));

КонецФункции

&НаКлиенте
Функция ВозможноЗаполнениеСтатусовМарок()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнена организация'"),,
			"Организация",,
			Отказ);
		
	КонецЕсли;
	
	Если ПомеченныеСтроки(Объект.ВидыНоменклатуры).Количество() = 0 Тогда
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбраны виды номенклатуры для заполнения'"),,
			"ВидыНоменклатуры",,
			Отказ);
		
	КонецЕсли;
	
	Если ПомеченныеСтроки(Объект.СтатусыМарок).Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбраны статусы марок для заполнения'"),,
			"СтатусыМарок",,
			Отказ);
		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Функция ВозможнаВыгрузкаМарок()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнена организация'"),,
			"Организация",,
			Отказ);
		
		КонецЕсли;
		
	Если СоздаватьСлужебныйДокументСодержащийСерии И Не ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнена организация ЕГАИС'"),,
			"ОрганизацияЕГАИС",,
			Отказ);
		
	КонецЕсли;
	
	Если ПомеченныеСтроки(Объект.Серии).Количество() = 0 Тогда
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбраны серии и марки для выгрузки'"),,
			"Серии",,
			Отказ);
		
	КонецЕсли;
		
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВыгружаемыеСтатусыМарок()
	
	ВсеВыгружаемыеСтатусыМарок = бг_ДвижениеМарокИнтеграция.СтатусыМарок();
	
	ОтмечаемыеСтатусыМарокПоУмолчанию = Новый Массив;
	ОтмечаемыеСтатусыМарокПоУмолчанию.Добавить(Перечисления.бг_СтатусыАкцизныхМарок.Оклеена);
	ОтмечаемыеСтатусыМарокПоУмолчанию.Добавить(Перечисления.бг_СтатусыАкцизныхМарок.НаБалансе);
	
	Для каждого СтатусМарки Из ВсеВыгружаемыеСтатусыМарок Цикл
		
		НоваяСтрока = Объект.СтатусыМарок.Добавить();
		НоваяСтрока.СтатусМарки = СтатусМарки;
		
		НоваяСтрока.Пометка = ОтмечаемыеСтатусыМарокПоУмолчанию.Найти(СтатусМарки) <> Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыНоменклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.АлкогольнаяПродукция
	|	И Номенклатура.ВидАлкогольнойПродукции.Маркируемый";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.ВидыНоменклатуры.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если Объект.ВидыНоменклатуры.Количество() = 1 Тогда
		Объект.ВидыНоменклатуры[0].Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьВыгружаемыеДанные(Форма)
	
	Для каждого СтрокаСтатусыМарок Из Форма.Объект.СтатусыМарок Цикл
		СтрокаСтатусыМарок.КоличествоМарокОстаток = 0;
	КонецЦикла;
	
	Форма.Объект.Номенклатура.Очистить();
	Форма.Объект.Серии.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыгружаемыеДанныеНаСервере()
	
	ОчиститьВыгружаемыеДанные(ЭтотОбъект);
	
	ВыгружаемыеДанные = ВыгружаемыеДанныеСвернутые();
	
	ЗаполнитьВыгружаемуюНоменклатуру(ВыгружаемыеДанные);
	ЗаполнитьВыгружаемыеСерии(ВыгружаемыеДанные);
	ЗаполнитьПоказателиВыгружаемыхСтатусовМарок(ВыгружаемыеДанные);
	
КонецПроцедуры

&НаСервере
Функция ВыгружаемыеДанныеСвернутые()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВременныеТаблицыМарокОстатков(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Марки.Номенклатура КАК Номенклатура,
	|	Марки.Серия КАК Серия,
	|	Марки.СтатусМарки КАК СтатусМарки,
	|	СУММА(Марки.Количество) КАК Количество
	|ИЗ
	|	Марки КАК Марки
	|
	|СГРУППИРОВАТЬ ПО
	|	Марки.Номенклатура,
	|	Марки.СтатусМарки,
	|	Марки.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатуры.Серия КАК Серия,
	|	СУММА(ОстаткиНоменклатуры.Количество) КАК Количество
	|ИЗ
	|	ВыгружаемыеСерииСОстатками КАК ОстаткиНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатуры.Номенклатура,
	|	ОстаткиНоменклатуры.Серия";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыгружаемыеДанные = Новый Структура;
	
	ВыгружаемыеДанные.Вставить("ОстаткиПоМаркам", РезультатыЗапроса[0].Выгрузить());
	ВыгружаемыеДанные.Вставить("ОстаткиПоСкладам", РезультатыЗапроса[1].Выгрузить());
	
	Возврат ВыгружаемыеДанные;
	
КонецФункции

&НаСервере
Функция ВыгружаемыеМарки(СерииКВыгрузке)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВременныеТаблицыМарокОстатков(МенеджерВременныхТаблиц, СерииКВыгрузке);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Марки.ГУИДМарки КАК ГУИДМарки,
	|	Марки.КодУпаковки КАК КодУпаковки
	|ИЗ
	|	Марки КАК Марки";
	
	ВыгружаемыеМарки = Запрос.Выполнить().Выгрузить();
	
	Возврат ВыгружаемыеМарки;
	
КонецФункции

&НаСервере
Процедура СформироватьВременныеТаблицыМарокОстатков(МенеджерВременныхТаблиц, СерииОтбор = Неопределено)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВыгружаемыеСерии
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СерииНоменклатуры.бг_Номенклатура = Номенклатура.Ссылка
	|			И (Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры))
	|ГДЕ
	|	&УсловиеОтбораПоСериям
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыгружаемыеСерии.Номенклатура КАК Номенклатура,
	|	ВыгружаемыеСерии.Серия КАК Серия,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК Количество
	|ПОМЕСТИТЬ ВыгружаемыеСерииСОстатками
	|ИЗ
	|	ВыгружаемыеСерии КАК ВыгружаемыеСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				&УсловиеОтбораПоСкладу
	|					И Серия В
	|						(ВЫБРАТЬ
	|							ВыгружаемыеСерии.Серия КАК Серия
	|						ИЗ
	|							ВыгружаемыеСерии КАК ВыгружаемыеСерии)) КАК ТоварыНаСкладахОстатки
	|		ПО ВыгружаемыеСерии.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоСОстаткомНаСкладе
	|				ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвижениеМарокСрезПоследних.ГУИДМарки КАК ГУИДМарки,
	|	ВыгружаемыеСерииСОстатками.Номенклатура КАК Номенклатура,
	|	ДвижениеМарокСрезПоследних.Серия КАК Серия,
	|	ДвижениеМарокСрезПоследних.КодУпаковки КАК КодУпаковки,
	|	ДвижениеМарокСрезПоследних.СтатусМарки КАК СтатусМарки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ Марки
	|ИЗ
	|	(ВЫБРАТЬ
	|		бг_ДвижениеМарокСрезПоследних.ГУИДМарки КАК ГУИДМарки,
	|		бг_ДвижениеМарокСрезПоследних.Серия КАК Серия,
	|		бг_ДвижениеМарокСрезПоследних.КодУпаковки КАК КодУпаковки,
	|		бг_ДвижениеМарокСрезПоследних.СтатусМарки КАК СтатусМарки
	|	ИЗ
	|		РегистрСведений.бг_ДвижениеМарок.СрезПоследних КАК бг_ДвижениеМарокСрезПоследних
	|	ГДЕ
	|		бг_ДвижениеМарокСрезПоследних.СтатусМарки В(&СтатусыМарок)) КАК ДвижениеМарокСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_ИдентификаторыМарок КАК бг_ИдентификаторыМарок
	|		ПО ДвижениеМарокСрезПоследних.ГУИДМарки = бг_ИдентификаторыМарок.ГУИДМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыгружаемыеСерииСОстатками КАК ВыгружаемыеСерииСОстатками
	|		ПО ДвижениеМарокСрезПоследних.Серия = ВыгружаемыеСерииСОстатками.Серия
	|ГДЕ
	|	бг_ИдентификаторыМарок.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ТолькоСОстаткомНаСкладе
	|				ТОГДА ВыгружаемыеСерииСОстатками.Количество > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВидыНоменклатуры", ВыбранныеВидыНоменклатуры());
	Запрос.УстановитьПараметр("СтатусыМарок", ВыбранныеСтатусыМарок());
	Запрос.УстановитьПараметр("ТолькоСОстаткомНаСкладе", ТолькоСОстаткомНаСкладе);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоСкладу", "Склад = &Склад");
		Запрос.УстановитьПараметр("Склад", Склад);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоСкладу", "Истина");
	КонецЕсли;
	
	Если СерииОтбор <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоСериям", "СерииНоменклатуры.Ссылка В(&Серии)");
		Запрос.УстановитьПараметр("Серии", СерииОтбор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоСериям", "Истина");
	КонецЕсли;
	
	Запрос.Выполнить();

КонецПроцедуры

&НаСервере
Функция ВыбранныеВидыНоменклатуры()
	
	ВыбранныеВидыНоменклатуры = Новый Массив;
	
	Для каждого СтрокаВидыНоменклатуры Из ПомеченныеСтроки(Объект.ВидыНоменклатуры) Цикл
		ВыбранныеВидыНоменклатуры.Добавить(СтрокаВидыНоменклатуры.ВидНоменклатуры);
	КонецЦикла;
	
	Возврат ВыбранныеВидыНоменклатуры;
	
КонецФункции

&НаСервере
Функция ВыбранныеСтатусыМарок()
	
	ВыбранныеСтатусыМарок = Новый Массив;
	
	Для каждого СтрокаСтатусыМарок Из ПомеченныеСтроки(Объект.СтатусыМарок) Цикл
		ВыбранныеСтатусыМарок.Добавить(СтрокаСтатусыМарок.СтатусМарки);
	КонецЦикла;
	
	Возврат ВыбранныеСтатусыМарок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВыгружаемуюНоменклатуру(ВыгружаемыеДанные)
	
	ВыгружаемаяНоменклатура = ВыгружаемыеДанные.ОстаткиПоМаркам.Скопировать(, "Номенклатура, Количество");
	ВыгружаемаяНоменклатура.Свернуть("Номенклатура", "Количество");
	
	ОстаткиНоменклатуры = ВыгружаемыеДанные.ОстаткиПоСкладам.Скопировать(, "Номенклатура, Количество");
	ОстаткиНоменклатуры.Свернуть("Номенклатура", "Количество");
	ОстаткиНоменклатуры.Индексы.Добавить("Номенклатура");
	
	Для каждого СтрокаВыгружаемаяНоменклатура Из ВыгружаемаяНоменклатура Цикл
		
		НоваяСтрокаНоменклатура = Объект.Номенклатура.Добавить();
		НоваяСтрокаНоменклатура.Номенклатура = СтрокаВыгружаемаяНоменклатура.Номенклатура;
		НоваяСтрокаНоменклатура.КоличествоМарокОстаток = СтрокаВыгружаемаяНоменклатура.Количество;
		НоваяСтрокаНоменклатура.КоличествоМарокКВыгрузке = СтрокаВыгружаемаяНоменклатура.Количество;
		НоваяСтрокаНоменклатура.Пометка = Истина;
		
		ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаВыгружаемаяНоменклатура.Номенклатура);
		НайденныеСтроки = ОстаткиНоменклатуры.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрокаНоменклатура.КоличествоОстатокСклад = НайденныеСтроки[0].Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыгружаемыеСерии(ВыгружаемыеДанные)
	
	ВыгружаемыеСерии = ВыгружаемыеДанные.ОстаткиПоМаркам.Скопировать(, "Номенклатура, Серия, Количество");
	ВыгружаемыеСерии.Свернуть("Номенклатура, Серия", "Количество");
	
	ОстаткиСерий = ВыгружаемыеДанные.ОстаткиПоСкладам.Скопировать(, "Номенклатура, Серия, Количество");
	ОстаткиСерий.Свернуть("Номенклатура, Серия", "Количество");
	ОстаткиСерий.Индексы.Добавить("Номенклатура, Серия");
	
	Для каждого СтрокаВыгружаемыеСерии Из ВыгружаемыеСерии Цикл
		
		НоваяСтрокаСерии = Объект.Серии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии, СтрокаВыгружаемыеСерии);
		НоваяСтрокаСерии.КоличествоМарокОстаток = СтрокаВыгружаемыеСерии.Количество;
		НоваяСтрокаСерии.КоличествоМарокКВыгрузке = СтрокаВыгружаемыеСерии.Количество;
		НоваяСтрокаСерии.Пометка = Истина;
		
		ПараметрыПоиска = Новый Структура(
			"Номенклатура, Серия",
			СтрокаВыгружаемыеСерии.Номенклатура,
			СтрокаВыгружаемыеСерии.Серия);
			
		НайденныеСтроки = ОстаткиСерий.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрокаСерии.КоличествоОстатокСклад = НайденныеСтроки[0].Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиВыгружаемыхСтатусовМарок(ВыгружаемыеДанные)
	
	ВыгружаемыеСтатусыМарок = ВыгружаемыеДанные.ОстаткиПоМаркам.Скопировать(, "СтатусМарки, Количество");
	ВыгружаемыеСтатусыМарок.Свернуть("СтатусМарки", "Количество");
	
	Для каждого СтрокаСтатусыМарок Из Объект.СтатусыМарок Цикл
		
		Если Не СтрокаСтатусыМарок.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура("СтатусМарки", СтрокаСтатусыМарок.СтатусМарки);
		НайденныеСтроки = ВыгружаемыеСтатусыМарок.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаСтатусыМарок.КоличествоМарокОстаток = НайденныеСтроки[0].Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьМаркиНаСервере()
	
	СерииКВыгрузке = СерииКВыгрузке();
	
	ВыгружаемыеМарки = ВыгружаемыеМарки(СерииКВыгрузке);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ВыгружатьСерии Тогда
			
			Если СоздаватьСлужебныйДокументСодержащийСерии Тогда
				СоздатьСлужебныйДокументСодержащийСерии(СерииКВыгрузке);
			КонецЕсли;
			
			ЗарегистрироватьСерииКВыгрузке(СерииКВыгрузке);
		КонецЕсли;
		
		СоздатьДокументВыгрузкиМарокУпаковок(ВыгружаемыеМарки);
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		ВызватьИсключение ОписаниеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСлужебныйДокументСодержащийСерии(СерииКВыгрузке)
	
	СерииВключатьВДокумент = Новый Массив;
	
	ТТНВходящаяЕГАИСОбъект = Документы.ТТНВходящаяЕГАИС.СоздатьДокумент();
	ТТНВходящаяЕГАИСОбъект.Грузополучатель = ОрганизацияЕГАИС;
	ТТНВходящаяЕГАИСОбъект.Дата = ТекущаяДатаСеанса();
	
	Для каждого Серия Из СерииКВыгрузке Цикл
		
		Запрос = Новый Запрос;
		бг_СерииНоменклатурыИнтеграция.ЗаполнитьТекстыЗапросовУсловиями(Запрос.Текст, "",,, Серия, Истина);
		Запрос.УстановитьПараметр("Ссылка", Серия);
		Запрос.УстановитьПараметр("УсловиеЗапроса", Истина);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СерииВключатьВДокумент.Добавить(Серия);
			Продолжить;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Не ЗначениеЗаполнено(Выборка.ОрганизацияВладелец_ЗначениеРеквизитаИдентификатор) Тогда
			СерииВключатьВДокумент.Добавить(Серия);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Серия Из СерииВключатьВДокумент Цикл
		НоваяСтрока = ТТНВходящаяЕГАИСОбъект.Товары.Добавить();
		НоваяСтрока.Серия = Серия;
	КонецЦикла;
	
	Если ТТНВходящаяЕГАИСОбъект.Товары.Количество() Тогда
		ТТНВходящаяЕГАИСОбъект.ОбменДанными.Загрузка = Истина;
		ТТНВходящаяЕГАИСОбъект.ПометкаУдаления = Истина;
		ТТНВходящаяЕГАИСОбъект.Комментарий = НСтр("ru='Служебный документ для выгрузки серий'");
		ТТНВходящаяЕГАИСОбъект.ДополнительныеСвойства.Вставить("адаптер_ЭтоЗагрузкаДанных", Истина);
		ТТНВходящаяЕГАИСОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьСерииКВыгрузке(СерииКВыгрузке)
	
	Перем адаптер_ИсходящиеСообщения;
	адаптер_ИсходящиеСообщения = ОбщегоНазначения.ОбщийМодуль("Справочники.адаптер_ИсходящиеСообщения");
	
	Для каждого Серия Из СерииКВыгрузке Цикл
		адаптер_ИсходящиеСообщения.ЗарегистрироватьИсходящееСообщениеПриЗаписи(Серия);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СерииКВыгрузке()
	
	ВыбранныеСтрокиСерии = ПомеченныеСтроки(Объект.Серии);
	СерииКВыгрузке = Новый Массив;
	Для каждого ВыбраннаяСтрокаСерии Из ВыбранныеСтрокиСерии Цикл
		СерииКВыгрузке.Добавить(ВыбраннаяСтрокаСерии.Серия);
	КонецЦикла;
	
	Возврат СерииКВыгрузке;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументВыгрузкиМарокУпаковок(ВыгружаемыеМарки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийИндекс = 0;
	ПоследнийИндекс = ВыгружаемыеМарки.Количество() - 1;
	
	// Ввиду ограничения 100 тысяч строк в ТЧ документа выгружаем марки порциями.
	КоличествоМарокНаИтерации = 5;
	
	Пока ТекущийИндекс <= ПоследнийИндекс Цикл
		
		ПоследнийИндексНаИтерацииВыгрузки = Мин(ТекущийИндекс + КоличествоМарокНаИтерации - 1, ПоследнийИндекс);
		
		ВыгрузкаМарокУпаковокОбъект = Документы.бг_ВыгрузкаМарокУпаковок.СоздатьДокумент();
		ВыгрузкаМарокУпаковокОбъект.Дата = ТекущаяДатаСеанса();
		ВыгрузкаМарокУпаковокОбъект.Организация = Организация;
		
		КодыУпаковок = Новый Массив;
		
		Для Счетчик = ТекущийИндекс По ПоследнийИндексНаИтерацииВыгрузки Цикл
		
			СтрокаВыгружаемыеМарки = ВыгружаемыеМарки[Счетчик];
			
			НоваяСтрока = ВыгрузкаМарокУпаковокОбъект.Марки.Добавить();
			НоваяСтрока.ГУИДМарки = СтрокаВыгружаемыеМарки.ГУИДМарки;
			
			Если СтрокаВыгружаемыеМарки.КодУпаковки <> ""
				И КодыУпаковок.Найти(СтрокаВыгружаемыеМарки.КодУпаковки) = Неопределено Тогда
				
				КодыУпаковок.Добавить(СтрокаВыгружаемыеМарки.КодУпаковки);
			КонецЕсли;
		
		КонецЦикла;
		
		ВыгрузкаМарокУпаковокОбъект.Записать();
		
		ВыгрузкаМарокУпаковокОбъект.Движения.бг_ДвижениеМарок.Записать();
		ВыгрузкаМарокУпаковокОбъект.Движения.бг_СоставУпаковок.Записать();
		
		ТекущийИндекс = ПоследнийИндексНаИтерацииВыгрузки + 1;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтметки(Таблица, НовоеЗначениеПометки, Номенклатура = Неопределено)
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		Если Номенклатура <> Неопределено И СтрокаТаблицы.Номенклатура <> Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Пометка = НовоеЗначениеПометки;
		
		Если СтрокаТаблицы.Пометка Тогда
			СтрокаТаблицы.КоличествоМарокКВыгрузке = СтрокаТаблицы.КоличествоМарокОстаток;
		Иначе
			СтрокаТаблицы.КоличествоМарокКВыгрузке = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьСерииПоЧастиНаименованияЗавершениеНаСервере(СтрокаПоискаСерии)

	Для каждого СтрокаСерии Из Объект.Серии Цикл
	
		Если СтрНайти(Строка(СтрокаСерии.Серия), СтрокаПоискаСерии) > 0 Тогда
			
			СтрокаСерии.Пометка = Истина;
			СтрокаСерии.КоличествоМарокКВыгрузке = СтрокаСерии.КоличествоМарокОстаток;
			
			ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаСерии.Номенклатура);
			НайденныеСтроки = Объект.Номенклатура.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				
				НайденныеСтроки[0].Пометка = Истина;
				НайденныеСтроки[0].КоличествоМарокКВыгрузке = НайденныеСтроки[0].КоличествоМарокКВыгрузке
					+ СтрокаСерии.КоличествоМарокКВыгрузке;
					
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
